{
  "challenge": {
    "enabled": true,
    "title": "Reto: Busca Busca",
    "description": "Has recibido una ruta con un zip comprimido llamado ctf_namsted.zip que contiene 1000 archivos JavaScript (.js). Uno o varios de esos .js contienen la cadena secreta 'FLAG{Palabra Secreta}' que te llevará a la bandera. Tu misión: descargar el ZIP, extraerlo, buscar la cadena dentro de los .js y entregar la bandera encontrada.",
    "objectives": [
      "1º Descargar y manejar archivos comprimidos con herramientas de línea de comandos.",
      "2º Recorrer masivamente archivos fuente (.js) y localizar cadenas concretas."
    ],
    "resources": [
      {
        "name": "Archivo CTF descargable",
        "description": "Descarga el paquete que contiene los 1000 .js y extrae su contenido. Sustituye la URL por la real que te haya facilitado el organizador del reto. Es posible que el comando wget no este instalado, apt install wget",
        "file": "ctf_namsted.zip",
        "download_example": "wget https://example.com/ctf_namsted.zip -O ctf_namsted.zip && unzip ctf_namsted.zip -d ctf_namsted"
      },
      {
        "name": "Capturar la evidencia y descomprimirla",
        "description": "Trabajas desde Ubuntu Server sin interfaz, debes capturar la evidencia y descomprimirla."
      }
    ]
  },
  "hints": [
    {
      "id": 1,
      "type": "text",
      "title": "Obtener evidencia",
      "content": "Has recibdo una URL, la tienes en las descripción del reto. Lo primero que tienes es que obtener el zip. Pudes usar el comando wget para obtenerla. Ejemplo: wget https://ejemplo.com/archivo.zip. "
    },
    {
      "id": 2,
      "type": "file",
      "title": "Descomprimir evidencia",
      "content": "ctf_namsted.zip",
      "description": "Además el archivo está comprimido. En función de la compresión puedes usar el comando unzip, unrar o  tar. Recueda el paquete puede no estar instalado, ejemplo apt install zip unzip. Ojo para futuro con file podemos saber el tipo de archivo, puede ser que ponga zip y que realmente sea un rar. No siempre es todo lo que parece."
    },

  {
  "id": 3,
  "type": "text",
  "title": "Búsqueda recursiva",
  "content": "Una vez que hayas descomprimido el archivo ctf_namsted.zip, sitúate dentro de la carpeta que contiene los 1000 archivos .js. Para buscar la cadena 'FLAG' en todo el árbol de directorios--> Usa el comando grep, no proporcion el comando completo, ya que sería muy sencilla. Pista grep y recursividad. "
}


  ],
  "delivery": {
    "flag_format_hint": "La bandera final suele tener formato FLAG{...} o similar. Cuando encuentres la cadena FLAG inspecciona las líneas adyacentes en el .js para localizar la bandera completa.",
    "expected_output_example": "Sube la cadena que esta contenida dentro de FLAG"
  }
}
